<!-- dflook/terraform-github-actions {"workspace":"default","backend_type":"gcs","backend":"a1c7c14457ecf980e742bbf7f8cce222d874701a358eff24ed64e3d13a6a26cc","plan_job_ref":"Job Plan Airflow DAGs #247 at https://github.com/cal-itp/data-infra/actions/runs/16209351221","plan_out_hash":"8f1f37f8bebaa0ef134e8c2d3ae98589f0d13a2ab3879efa26e553259d496893","plan_hash":"58c25274ff2d326b103ea807a0bdb6ad672685355d1339af48d3d5697b2c98aa","plan_text_format":"diff","version":"1.49.0"} -->
Terraform plan in __iac/cal-itp-data-infra/airflow/us__
<details>
<summary>Plan: 0 to add, 3 to change, 0 to destroy.</summary>

```diff
Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
!~  update in-place

Terraform will perform the following actions:

  # google_storage_bucket_object.calitp-composer-catalog will be updated in-place
!~  resource "google_storage_bucket_object" "calitp-composer-catalog" {
!~      content             = (sensitive value)
!~      crc32c              = "kRpTXw==" -> (known after apply)
!~      detect_md5hash      = "jB+vU4xZtSXqFNkXlEOFoQ==" -> "different hash"
!~      generation          = 1752191635207770 -> (known after apply)
        id                  = "calitp-composer-data/warehouse/target/catalog.json"
!~      md5hash             = "jB+vU4xZtSXqFNkXlEOFoQ==" -> (known after apply)
        name                = "data/warehouse/target/catalog.json"
#        (16 unchanged attributes hidden)
    }

  # google_storage_bucket_object.calitp-composer-manifest will be updated in-place
!~  resource "google_storage_bucket_object" "calitp-composer-manifest" {
!~      content             = (sensitive value)
!~      crc32c              = "LrvsSQ==" -> (known after apply)
!~      detect_md5hash      = "2K7c85e1EMDnxtjky8pXvw==" -> "different hash"
!~      generation          = 1752191636882005 -> (known after apply)
        id                  = "calitp-composer-data/warehouse/target/manifest.json"
!~      md5hash             = "2K7c85e1EMDnxtjky8pXvw==" -> (known after apply)
        name                = "data/warehouse/target/manifest.json"
#        (16 unchanged attributes hidden)
    }

  # google_storage_bucket_object.calitp-composer-partial_parse will be updated in-place
!~  resource "google_storage_bucket_object" "calitp-composer-partial_parse" {
!~      content             = (sensitive value)
!~      crc32c              = "OzNfuQ==" -> (known after apply)
!~      detect_md5hash      = "gQDYRjFTdm3tOMNXeu84Og==" -> "different hash"
!~      generation          = 1752010341206630 -> (known after apply)
        id                  = "calitp-composer-data/warehouse/target/partial_parse.msgpack"
!~      md5hash             = "gQDYRjFTdm3tOMNXeu84Og==" -> (known after apply)
        name                = "data/warehouse/target/partial_parse.msgpack"
#        (16 unchanged attributes hidden)
    }

Plan: 0 to add, 3 to change, 0 to destroy.
```
</details>

:memo: Plan generated in [Plan Airflow DAGs #247](https://github.com/cal-itp/data-infra/actions/runs/16209351221)